areiter128/DPSK3/dspic/src/driver/power_controllers/drv_power_controller_buck_custom.c
//=======================================================================================================
// Copyright(c) 2018 Microchip Technology Inc. and its subsidiaries.
// Subject to your compliance with these terms, you may use Microchip software and any derivatives
// exclusively with Microchip products. It is your responsibility to comply with third party license
// terms applicable to your use of third-party software (including open source software) that may
// accompany Microchip software.
// THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
// APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
// FITNESS FOR A PARTICULAR PURPOSE.
// IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
// LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
// MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
// ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
// EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
//=======================================================================================================

//=======================================================================================================
// @file drv_power_controller_buck_custom.c
//
// @brief power controller functions for buck converter
//
// @author M91406
// @author M52409
// @author M91281
//
// @date July 9, 2019, 1:10 PM
//=======================================================================================================

#include <stdbool.h>
#include <stdint.h>
#include <xc.h>         // include processor specific defines and functions

#include "driver/power_controllers/drv_power_controllers.h"
#include "driver/power_controllers/drv_power_controller_buck_generic.h"
#include "driver/power_controllers/drv_power_controller_buck_custom.h"
#include "driver/power_controllers/npnz16b.h"
#include "driver/power_controllers/c2p2z_buck.h"
//#include "init_pwm.h"
//#include "init_acmp.h"
//#include "init_adc.h"

//=======================================================================================================
// local defines
//=======================================================================================================
// Buck instance 1 specific defines:
#define BUCK1_ADC_REFERENCE     3.3             // 3.3 Volts ==> maximum ADC-Value
#define BUCK1_ADC_RESOLUTION    4095UL          // 12 bits
#define BUCK1_FEEDBACK_GAIN     0.5             // 1k /(1k+1k)

POWER_CONTROLLER_DATA_t pwrCtrlBuck1_Data;      // data instance for the buck converter


//=======================================================================================================
// @brief   returns the Output Voltage in Volts as a double
//=======================================================================================================
double Drv_PowerControllerBuck1_GetOutputVoltage()
{
    return (double)(((unsigned long)pwrCtrlBuck1_Data.voltageOutput * BUCK1_ADC_REFERENCE) / (BUCK1_FEEDBACK_GAIN * BUCK1_ADC_RESOLUTION));
}


//=======================================================================================================
// @brief   sets the Output Voltage Reference in Volts
// @note    call this function after calling the Init function to tell power controller the needed reference voltage 
//=======================================================================================================
void Drv_PowerControllerBuck1_SetOutputVoltageReference(double newVoltRef)
{
    pwrCtrlBuck1_Data.voltageRef_softStart = ((newVoltRef * BUCK1_ADC_RESOLUTION * BUCK1_FEEDBACK_GAIN) / BUCK1_ADC_REFERENCE);
}


//=======================================================================================================
// @brief   sets the Output Voltage Reference in Millivolts
// @note    call this function after calling the Init function to tell power controller the needed reference voltage
//=======================================================================================================
void Drv_PowerControllerBuck1_SetOutputVoltageReference_mV(uint32_t newVoltRef_mV)
{
    pwrCtrlBuck1_Data.voltageRef_softStart = ((((uint32_t)newVoltRef_mV * BUCK1_ADC_RESOLUTION) * BUCK1_FEEDBACK_GAIN) / BUCK1_ADC_REFERENCE) / 1000;
}

void Drv_PowerControllerBuck1_EnableControlLoop(void)
{
    c2p2z_buck.status.flag.enable = 1;  // Start the control loop for buck
    PG1IOCONLbits.OVRENH = 0;           // User override disabled for PWMxH Pin
    PG1IOCONLbits.OVRENL = 0;           // User override disabled for PWMxL Pin
}

void Drv_PowerControllerBuck1_DisableControlLoop(void)
{
    c2p2z_buck.status.flag.enable = 0;  // Stop the control loop for buck
    PG1IOCONLbits.OVRENH = 1;           // User override disabled for PWMxH Pin
    PG1IOCONLbits.OVRENL = 1;           // User override disabled for PWMxL Pin
    //TODO: should we set some output pin for safety reasons???
}

void Drv_PowerControllerBuck1_LaunchPeripherals(void)
{
    Drv_PowerControllerBuck1_LaunchACMP();          // Start analog comparator/DAC module
    Drv_PowerControllerBuck1_LaunchAuxiliaryPWM();  // Start auxiliary PWM 
    Drv_PowerControllerBuck1_LaunchPWM();           // Start PWM
}

//=======================================================================================================
// @brief   Initializes the Buck Power Converter - Instance 1
// @note    In this routine all the application specific custom functions are implemented
//=======================================================================================================
void Drv_PowerControllerBuck1_Init(bool autostart)
{
    Drv_PowerControllerBuck_Init(&pwrCtrlBuck1_Data, autostart);

/*
    pPCData->voltageRef_compensator = 0;                // 2047 for 3.3V
    pPCData->voltageOutput = 0;
    pPCData->flags.value = 0;                           //reset everything
    pPCData->flags.bits.adc_active = false;
    // Reset state machine to the beginning
    buckPC_GotoState(pPCData, PCS_STARTUP_PERIPHERALS);
//    Drv_PowerControllerBuck_SetOutputVoltageReference_mV(pPCData, outputVoltageRef_mV);
    Drv_PowerControllerBuck_CalculateVoltageLimits(pPCData);
  */
            
    pwrCtrlBuck1_Data.voltageRef_rampStep = 4;              // 4 adc values per 100µs
    pwrCtrlBuck1_Data.powerInputOk_waitTime_100us = 1000;   // 100ms input power stabilization delay
    pwrCtrlBuck1_Data.powerOutputOk_waitTime_100us = 1000;  // 100ms output power stabilization delay
    pwrCtrlBuck1_Data.ftkEnableControlLoop  = Drv_PowerControllerBuck1_EnableControlLoop;
    pwrCtrlBuck1_Data.ftkDisableControlLoop = Drv_PowerControllerBuck1_DisableControlLoop;
    pwrCtrlBuck1_Data.ftkLaunchPeripherals  = Drv_PowerControllerBuck1_LaunchPeripherals;
    
